{
    "plan": [
        "You are planning to spend Monday and Tuesday working on a presentation that you have to give on Wednesday.",
        "You are planning to go to a yoga class on Monday, Wednesday and Friday morning and catch up on emails in the afternoon.",
        "You are planning to meet with your team on Monday to discuss the progress of your project and set goals for the week.",
        "You are planning to attend a networking event on Tuesday evening and work on a report on Thursday.",
        "You are planning to spend Wednesday and Thursday working on a proposal that is due on Friday.",
        "You are planning to take Friday off and spend the day with your family and friends.",
        "You are planning to relax and catch up on any work that needs to be done before the start of the next week on Sunday.",
        "You are planning to take a short vacation next weekend to recharge and come back refreshed for the next month.",
        "You are planning to attend a professional conference in the middle of the month to learn about the latest industry developments.",
        "You are planning to start a new workout routine at the beginning of the month and aim to stick to it throughout the month.",
        "You are planning to work on a big project at work throughout the month, setting weekly and monthly milestones to stay on track.",
        "You are planning to spend time volunteering at a local charity organization once a week throughout the month.",
        "You are planning to dedicate time to learning a new skill or hobby, such as a language or instrument, during the month.",
        "You are planning to host a dinner party for friends and family at the end of the month to catch up and celebrate.",
        "You are planning to set aside time to review and reflect on your personal and professional goals for the year and make any necessary adjustments.",
        "You are planning to save up for a big trip or vacation in the coming 6 months.",
        "You are planning to take a course or certification in order to advance in your career.",
        "You are planning to start a new business or side hustle in the next 6 months.",
        "You are planning to move to a new house or apartment in the next 6 months.",
        "You are planning to start a family or expand your existing family in the next 6 months.",
        "You are planning to work on a personal project or pursue a passion in the next 6 months.",
        "You are planning to focus on improving your physical and mental well-being in the next 6 months.",
        "You are planning to make a career transition or switch to a new field in the next 6 months.",
        "You are planning to take a sabbatical or extended time off to travel and explore new places in the coming year.",
        "You are planning to go back to school to pursue a graduate degree or additional certification.",
        "You are planning to make a significant investment in your business or career to take it to the next level.",
        "You are planning to purchase a new home or renovate your current home in the coming year.",
        "You are planning to volunteer or do a social work in your community or abroad in the coming year.",
        "You are planning to start a new hobby or pick up an old one, like photography, painting or writing in the coming year.",
        "You are planning to focus on improving your physical and mental well-being by practicing mindfulness, yoga and meditation in the coming year.",
        "You are planning to take steps to achieve a better work-life balance and make time for loved ones in the coming year."
    ]
}