{
    "news": [
        "Argentina won the championship of World Cup.",
        "King Charles' first Christmas speech reflects cost-of-living crisis.",
        "Protests in Paris after three killed in shooting.",
        "Pope calls for end to 'senseless' war in Ukraine during Christmas message.",
        "Fatal winter storm leaves millions without power in North America with -45C temperatures.",
        "Major NGOs halt work in Afghanistan after Taliban ban on female workers.",
        "Winter storm causes power outages, hits Americans with snow and freezing temperatures before Christmas.",
        "Jordan seizes huge amphetamine haul at Irap border.",
        "A huge avalanche happened in Austria.",
        "15 people died in a tanker truck explosion in South Africa.",
        "Zelensky's sobering Christmas message to Ukraine describes 'Loss of Hope'.",
        "'Serpent' serial killer Charles Sobhraj returns to France after 19 years in prison.",
        "Ex-Maoist rebel leader Prachanda becomes Nepal PM for third time.",
        "The UK royal family attend Christmas day service.",
        "Conservatives outraged Joe Biden didn't say 'Jesus' in Christmas message.",
        "China's COVID-19 surge raises odds of new coronavirus mutant.",
        "Bethlehem rebounds from pandemic, lifting Christmas spirits.",
        "US warns of possible attack in Islamabad amid security fears.",
        "India makes negative COVID test mandatory for five countries.",
        "Putin vows to destory U.S. Patriot Missle Defense System in Ukraine.",
        "Germany's energy crisis is a cue to chop wood and stock up.",
        "Some Ukrainians move up Christmas to part ways with Russia.",
        "Russia threatens to Slash Oil Output, unleashes panic in oil markets.",
        "Holiday storm causes mass power outages.",
        "UK pub shooting leaves 1 dead on Christmas Eve.",
        "Police arrest man suspected of planting explosive in Brazil's capital ahead of presidential inauguration.",
        "Tomahawk missiles: Japan to spend billions on procuring & deploying US navy missiles to deter China.",
        "British PM criticized over interaction with homeless man.",
        "Retirement: New Rules Are Coming For 401(k) and IRA Accounts.",
        "Snowden to Musk: 'I Take Payment in Bitcoin'; Big Short Investor Says Audits of Exchanges like Binance and FTX Are 'Meaningless,' and More.",
        "Thousands lose power after three substations targeted in Washington state, sheriff says.",
        "Sam Bankman-Fried found ‘chilling’ in JFK airport lounge on $250M bail bond.",
        "No Santa Claus rally in sight as stocks round out grim 2022.",
        "Samsung recalls more than 660,000 washing machines after fire hazard reports.",
        "Short-sellers make $15 billion betting against Tesla as shares in Elon Musk's company sink by 70% this year.",
        "Maryland one of 13 states warned of rolling blackouts, asked to conserve.",
        "Tesla owner says he had to cancel Christmas plans because car would not charge in freezing weather.",
        "A threat actor is claiming they have obtained data of 400,000,000 Twitter users and is offering it for sale.",
        "ChatGPT’s AI Makes Puzzles that’ll Make You Want to Throw Brickbats.",
        "KFC became Japan's go-to Christmas dinner.",
        "Surging Electricity Prices Make Some Gas Vehicles Cheaper Than Electric Ones In Europe.",
        "Oil Passes Natural Gas as Main Fuel for Power Plants in New England.",
        "Elon Musk says Twitter is no longer 'in the fast lane to bankruptcy' – but still isn't 'secure'.",
        "Facebook parent Meta will pay $725M to settle user data case.",
        "Target Recalls Over 200,000 Children’s Weighted Blankets After 2 Girls Die.",
        "Crypto Founders And Bitcoin Moguls Lost $116 Billion In 2022.",
        "FTX paid $12M retainer to a New York law firm before bankruptcy filing.",
        "Alameda Executive Says She Is ‘Truly Sorry’ for Her Role in FTX Collapse.",
        "November Carbon Emissions In Europe Lowest In 30 Years.",
        "Alphabet reshuffles to meet ChatGPT threat and Sundar's not having a happy holiday.",
        "Report: Netflix Plans To Crack Down On Password Sharing In 2023.",
        "Qualcomm’s going toe-to-toe with Apple’s satellite messaging feature",
        "Breaking ranks, Macron’s gift of tanks to Ukraine puts Western alliance under pressure to give Zelensky what he needs to end the war",
        "Ukraine war: Kyiv rejects Putin's 'trivial' Christmas truce",
        "Prince Harry reveals whether he’s circumcised in bombshell ‘Spare’ memoir",
        "Employers could sue unions under planned anti-strike laws",
        "Pope Francis leads funeral for predecessor Benedict XVI, a first in modern times",
        "Prince Harry says Princess Diana would be 'sad' about rift between her sons",
        "India set to spend $2 bn on green hydrogen projects",
        "Up to half of the world’s glaciers could disappear even if ambitious climate targets are hit, new study finds",
        "Photos: Europe sees spell of record warm winter temps",
        "Federal Trade Commission proposes ban on noncompete clauses",
        "Ram previews new electric pickup to rival Ford, Rivian and others",
        "US Closes In on Bankman-Fried Inner Circle With Probe of FTX Chief Engineer",
        "Delta Air Lines is rolling out free Wi-Fi",
        "Exclusive: Microsoft, Activision back off aggressive claim in FTC case",
        "Nintendo Slashes Prices Of Switch eShop Games In New Year Sale (North America)",
        "The PS5 Is Getting An Ultra Customizable Controller That Lets New Fans Play",
        "LG's Latest OLED TV Lineup Goes Up to 70% Brighter in 2023",
        "HTC Announces Its Standalone VR Headset",
        "Google Chrome Is About to Be Problem on Your Parents’ PC by Ending Support on Windows 7,8 and 8.1",
        "Spotify and Google team up to supercharge the Android 13 media player",
        "Samsung Unveils SmartThings Station at CES 2023, Making Smarter Homes Accessible for Everyone",
        "‘Stranger Things’ Actor Noah Schnapp Comes Out as Gay: ‘Never That Serious’",
        "Lisa Rinna Is 'Grateful' as She Announces Exit from 'The Real Housewives of Beverly Hills' After 8 Seasons",
        "Jeremy Renner posts video update: ‘ICU spa moment to lift my spirits’",
        "Aubrey Plaza and Michael B. Jordan set to host ‘Saturday Night Live’",
        "Will ‘Avatar 2’ Hit $2 Billion? Breaking Down the Blockbuster Sequel’s Path to Box Office Glory"
    ]
}